Repository: shimsw20/theorem_proving_in_lean4
Catalog: locale/kr/kr-level2.tmx
Source language: en_us
Languages: ko

source: Lean also provides a complementary case tactic, which allows you to focus on goal assign variable names.
ko: 린은 여러분이 목표에 변수 이름을 할당할 수 있게 하는 보완적인 case 전략도 제공합니다.

source: Lean also provides a pattern-matching let expression:
ko: 또 린은 패턴-매칭 let 표현식을 제공합니다.<부분 1562 ¶>

source: Lean also supports a structured way of reasoning backwards from a goal, which models the "suffices to show" construction in ordinary mathematics.
ko: 린은 또 구조화된 목표로부터 후방향 추론 방식을 지원합니다. 이것은 일상 수학에서 "보여주기에 충분하다" 구성을 모델링 한 것입니다.

source: Lean also supports mutual recursive definitions.
ko: 린도 상호적인 재귀적 정의를 지원합니다.

source: Lean also supports the use of various editors, which provide continuous checking and feedback.
ko: 또한 린은 다양한 끊임없는 확인과 피드백을 제공하는 편집기의 사용을 지원합니다.

source: Lean can usually infer the type α, but it is often a good idea to write it explicitly.
ko: Lean은 α의 유형을 추론할 수 있습니다. 그러나 이를 명백히 적는 것이 좋습니다.

source: Lean can also handle more complex forms of pattern matching, in which arguments to dependent types pose additional constraints on the various cases.
ko: 린은 인수가 다양한 경우에 대해 추가적인 제약을 의존 유형에 부여하는 것 같은 패턴 매칭의 더 복잡한 형태도 다룰 수 있습니다.

source: Lean can not only define mathematical objects and express mathematical assertions in dependent type theory, but it also can be used as a language for writing proofs.
ko: 린은 수학적 대상들을 정의하고 수학적 주장을 의존 유형론으로 진술할 수 있고 증명을 작성하는 언어로써 사용될 수 있습니다.

source: Lean comes with ToString instances for most builtin types.
ko: 린은 대다수의 내장된 유형에 대한 ToString와 함께 나옵니다.

source: Lean converts them into a let rec.
ko: 린은 그들을 let rec으로 바꿉니다.

source: Lean creates an auxiliary declaration for each let rec.
ko: 린은 각 let rec에 대해 부가 선언을 만듭니다.

source: Lean defines all the standard logical connectives and notation.
ko: 린은 모든 표준 논리 연결사와 표기를 정의합니다.

source: Lean detects that the proof uses hp and automatically adds hp : p as a premise.
ko: 린은 hp를 사용하는 증명을 감지하고 자동적으로 hp : p를 전제로 추가합니다.

source: Lean elaborates the terms (2 : Nat) and (2 : Rational) as OfNat.ofNat Nat 2 (instOfNatNat 2) and OfNat.ofNat Rational 2 (instOfNatRational 2) respectively.
ko: 린은 항 (2 : Nat)과 (2 : Rational)을 각각 OfNat.ofNat Nat 2 (instOfNatNat 2)과 OfNat.ofNat Rational 2 (instOfNatRational 2)으로 만듭니다.

source: Lean has mechanisms to detect and insert coercions of this sort.
ko: 린은 이런 종류의 coercions의 감지와 삽입하는 메커니즘이 있습니다.

source: Lean has very complex mechanisms for instantiating implicit arguments, and we will see that they can be used to infer function types, predicates, and even proofs.
ko: Lean은 암시적인 인수를 인스턴스화(instantiating)하는데 아주 복잡한 매커니즘을 가지고 있습니다. 그리고 우리는 함수의 유형과 술어 그리고 심지어 증명을 추론하는데 사용될 수 있음을 볼 것입니다.

source: Lean interprets the final three examples as the same expression; in the last expression, Lean infers the type of x and y from the expression if not y then x + 1 else x + 2.
ko: 린은 마지막 세 예제를 같은 표현식으로 해석합니다. 마지막 표현식에서 린은 x와 y의 유형을 표현식 if not y then x + 1 else x + 2으로부터 추론합니다.

source: Lean is a complete programming language.
ko: 린은 완전한 프로그래밍 언어입니다.

source: Lean is based on a version of dependent type theory known as the Calculus of Constructions, with a countable hierarchy of non-cumulative universes and inductive types.
ko: 린은 직관주의 계산법이라고 하는 가산적인 비축적적 세계(Universe)와 귀납형이 있는 의존 유형론 버전을 기반합니다.

source: Lean is released under the Apache 2.0 license, a permissive open source license that permits others to use and extend the code and mathematical libraries freely.
ko: Lean은 Apache 2.0 라이센스하에서 배포되었습니다. 이는 타인에게 자유롭게 사용하는 것과 수학 라이브러리 및 코드의 확장을 허락합니다.

source: Lean is smart enough to figure out which variables are used explicitly or implicitly in a definition.
ko: Lean은 정의에서 명시적으로나 암시적으로 사용된 변수를 구분하기에 충분히 똑똑합니다.

source: Lean knows that the usual order < on the natural numbers is well founded.
ko: 린은 자연수에 대한 평상시 순서 <가 잘 세워졌다는 것을 압니다.

source: Lean maintains a number of internal variables that can be set by users to control its behavior.
ko: 린은 사용자가 설정하여 그 행동을 제어하는 하는 다수의 내부 변수를 관리합니다.

source: Lean offers a weaker annotation, {{y : ℕ}}, which specifies that a placeholder should only be added before a subsequent explicit argument.
ko: 린은 종종 자리차지자가 이후의 명시적인 인수 앞에 추가되어야 함을 나타내는 약한 주석 {{y : ℕ}}을 제공합니다.

source: Lean provides a fun (or λ) keyword to create a function from an expression as follows:
ko: 린은 fun (또는 λ) 키워드를 제공하여 다음과 같은 표현식으로부터 함수를 만들 수 있게 합니다.

source: Lean provides a more convenient way to eliminate from an existential quantifier with the match expression:
ko: 린은 match 표현식이 있는 존재 한정기호를 더 편리하게 제거하는 방법을 제공합니다.

source: Lean provides another useful syntactic gadget.
ko: 린은 또 다른 유용한 문법적 도구를 제공합니다.

source: Lean provides natural ways of defining recursive functions, performing pattern matching, and writing inductive proofs.
ko: 린은 재귀적인 함수를 정의하는 자연스러운 방법을 제공하고, 패턴 매치를 수행하고, 귀납적 정의를 작성합니다.

source: Lean provides various sectioning mechanisms to help structure a theory.
ko: 린은 이론을 구조화하는 것을 돕기 위해 구획을 나누는 다양한 메커니즘을 제공합니다.

source: Lean provides you with the variable command to make such declarations look more compact:
ko: 린은 여러분에게 이런 선언을 더 간결하게 보이게 만들도록 variable 명령을 제공합니다.

source: Lean provides you with the ability to group definitions into nested, hierarchical namespaces:
ko: Lean은 여러분에게 정의를 중첩되고 계층적인 namespaces에 묶을 수 있는 능력을 제공합니다.

source: Lean raises an error if any of the field names remain unspecified after all the objects are visited.
ko: 린은 모든 개체들이 방문된 이후에도 어떤 필드 이름이라도 명시되지 않고 남아있다면 오류를 발생시킵니다.

source: Lean then automatically builds the isomorphism between TreeList α and List (Tree α) in its kernel, and defines the constructors for Tree in terms of the isomorphism.
ko: 그 후 린은 자동적으로 그것의 커널에서 TreeList α과List (Tree α) 사이의 동형을 만듭니다. 그리고 동형에 대해서 Tree에 대한 생성자를 정의합니다.

source: Lean therefore provides the following alternative notations for defining elements of a structure type.
ko: 그래서 린은 구조체의 원소를 정의하는데 다음의 대안 기호를 제공합니다

source: Lean tries to use type information to disambiguate the meaning in context, but you can always disambiguate by giving the full name.
ko: 린은 맥락에서 의미의 모호함을 해소하려고 유형 정보를 사용하려고 합니다. 그러나 여러분은 이들의 완전한 이름을 주는 것으로 모호성을 항상 풀 수 있습니다.

source: Lean uses the context to infer which one is appropriate.
ko: 린은 어떤 것이 적절한 지 추론하는데 맥락을 사용합니다.

source: Lean uses the match construct internally to implement pattern-matching in all parts of the system.
ko: 린은 시스템의 모든 부분에서 내부적으로 패턴 매칭을 구현하고자 match 생성을 사용합니다.

source: Lean will even allow us to use an implicit match in the fun expression:
ko: 더욱이 린은 우리에게 fun 표현식에서 암시적인 match를 사용할 수 있게 해줍니다.

source: Lean will start type class synthesizer even when these parameters have missing parts.
ko: 이들의 매개변수에 모르는 부분이 있을 지라도 린은 유형 클래스 합성기를 시작할 것입니다.

source: Lean's equation compiler, described in the next chapter, is needed to make use of these types effectively.
ko: 다음 장에서 설명할 린의 방정식 컴파일러는 이 유형의 사용을 효과적으로 만들기 위해 필요합니다.

source: Lean's library contains a large number of common identities, such as these:
ko: 린의 라이브러리는 이와 같은 흔한 항등식들을 많이 가지고 있습니다.

source: Lean's library developers follow general naming guidelines to make it easier to guess the name of a theorem you need, or to find it using tab completion in editors with a Lean mode that supports this, which is discussed in the next section.
ko: 린의 라이브러리 개발자는 여러분이 필요한 정리의 이름을 추측하기 더 쉽게 일반적인 이름짓기 규칙을 따릅니다. 혹은 린 모드인 편집기의 탭 완성 지원 기능으로 그것을 찾도록 돕습니다. 탭 완성은 다음 섹션에서 얘기합니다.

source: Lean's mechanisms for guessing a well-founded relation and then proving that recursive calls decrease are still in a rudimentary state.
ko: 린의 잘 세워진 관계식을 추론하는 메커니즘과 재귀적인 호출이 줄어든다는 증명은 여전히 기초적인 상태입니다.

source: Lean's parser is extensible, which is to say, we can define new notation.
ko: 린의 구문분석기는 확장가능성이 있습니다. 그 말은 우리가 새로운 기호를 정의할 수 있다는 뜻입니다.

source: Lean's standard library can be found online, on GitHub:
ko: 린의 표준 라이브러리는 깃허브에서 찾을 수 있습니다.

source: Lean's standard library contains proofs of many valid statements of propositional logic, all of which you are free to use in proofs of your own.
ko: 린의 표준 라이브러리는 명제 논리의 유효한 많은 진술들이 담겨있고 그 모든 것들은 여러분들의 주장을 증명하는데 자유롭게 사용될 수 있습니다.

source: Lean's standard library defines two predicates, Acc r a and WellFounded r, where r is a binary relation on a type α, and a is an element of type α.
ko: 린의 표준 라이브러리는 두 술어 Acc r a과 WellFounded r을 정의합니다. 여기서 r은 α형에 대한 이항 관계이고 a는 α형 원소입니다.

source: Lean's syntax can be extended and customized by users at every level, ranging from basic "mixfix" notations to custom elaborators.
ko: 린의 문법은 모든 수준에서 사용자에 의해 기본적인 "혼합 수정" 기호에서 관습적인 협력기에 이르기까지 확장되거나 사용자가 정의해 쓸 수 있습니다.

source: Lean's task, as a proof assistant, is to help us to construct such a term, t, and to verify that it is well-formed and has the correct type.
ko: 증명 보조기로써 린의 일은 그러한 항 t를 생성하고 그것이 올바른 유형이고 잘 형성된 것을 검증하도록 돕는 것입니다.

source: Lean's underlying foundation has an infinite hierarchy of types:
ko: 린의 기저에는 무한한 유형의 계층이 있습니다.

source: Lean's underlying logic has a computational interpretation, and Lean can be viewed equally well as a programming language.
ko: Lean의 기본 논리는 컴퓨팅 해석기(interpretor)을 가지는데 있다. 그래서 Lean은 프로그래밍 언어와 마찬가지로 동등하게 볼 수 있습니다.

source: Let us consider another example of a type class defined in the standard library, namely the type class of Decidable propositions.
ko: 표준 라이브러리에 정의된 유형 클래스의 다른 예 즉, 결정 가능한 명제 유형 클래스를 고려해 봅시다.

source: Let us consider some more examples of inductively defined types.
ko: 재귀적으로 정의된 유형에 대해 몇 가지 예제를 더 고려해봅시다.

source: Let us first consider the case where the inductive type is not specified to land in Prop.
ko: 우선 귀납형이 Prop에 머무른다고 명시되지않은경우를 생각해봅시다.

source: Let us now turn to one of the most fundamental relations defined in Lean's library, namely, the equality relation.
ko: 이제 주로 동등 관계라고 하는 린의 라이브러리에 정의된 가장 기초적인 관계 중 하나로 가봅시다.

source: Let us start with the first step of the program above, declaring an appropriate class:
ko: 위 프로그램의 첫 단계인 적절한 클래스를 선언하는 것부터 시작합시다.

source: Let us start with the logical background that is needed to understand how it works.
ko: 우선 이것이 어떻게 동작하는지 이해하는데 필요한 논리적 배경으로 시작합시다.

source: Let's create one that adds two natural numbers:
ko: 두 자연수를 더하는 함수를 만들어 봅시다.

source: Let's take a look at some basic syntax.
ko: 몇 가지 기본 문법에 대해 살펴봅시다.

source: Like sections, namespaces can be nested:
ko: section처럼 이름공간도 중첩될 수 있습니다.

source: Like sections, nested namespaces have to be closed in the order they are opened.
ko: 섹션과 마찬가지로 중첩된 이름공간은 그들이 열린 순서대로 닫혀야 합니다.

source: Local Definitions
ko: 지역 정의(Local Definitions)

source: Local Instances
ko: 지역 개체

source: Local recursive declarations
ko: 지역적인 재귀 선언

source: Logical Equivalence
ko: 논리적 동등성

source: Logically speaking, having an element t : Decidable p is stronger than having an element t : p ∨ ¬p; it enables us to define values of an arbitrary type depending on the truth value of p.
ko: 논리적으로 말하자면 원소 t : Decidable p를 갖는 것은 원소 t : p ∨ ¬p을 갖는 것보다 강합니다. 이는 우리가 p의 진리값에 의존하는 임의의 유형의 값을 정의할 수 있게 합니다.

source: Look up the definition of a Fermat prime or any of the other statements, if necessary.
ko: 페르마 소수의 정의나 필요하다면 다른 문장들을 찾아보세요.

source: Make sure Lean accepts the term with all the sorry's; if not, there are errors that you need to correct.
ko: 린이 모든 sorry에 대한 말을 받아들이게 만드세요. 그렇지 않으면 여러분이 고쳐야 하는 에러가 생깁니다.

source: Managing Type Class Inference
ko: 유형 클래스 추론 관리하기

source: Many people have contributed to the effort, providing corrections, suggestions, examples, and text.
ko: 많은 사람들이 오타 정정, 제안, 예제, 본분을 제공하는 등의 노력으로 기여했습니다.

source: Marking the position as an inaccessible pattern tells the equation compiler first, that the form of the argument should be inferred from the constraints posed by the other arguments, and, second, that the first argument should not participate in pattern matching.
ko: 접근 불가한 패턴으로 위치를 표시하는 것은 우선 방정식 컴파일러에게 인수의 모양이 다른 인수에 부과된 제약으로부터 추론될 수 있어야 한다고 말합니다. 그리고 두 번째로 첫 인수가 패턴 매칭에 참여하지 않아야 합니다.

source: Match Expressions
ko: 매치 표현식

source: More Tactics
ko: 이 외의 전략들

source: More generally, given an expression p.foo x y z where p : Point, Lean will insert p at the first argument to Point.foo of type Point.
ko: 더 일반적으로 p : Point일 때 제시된 표현식 p.foo x y z에 대해, 린은 Point형의 첫 번째 인수로 Point.foo에 p를 삽입할 것입니다.

source: More importantly, the cases tactic will detect any items in the local context that depend on the target variable.
ko: 더 중요하게 cases 전략은 대상 변수에 의존하는 지역 상황 속 임의의 항목을 감지할 수 있습니다.

source: More information can be found on the Lean documentation pages.
ko: 린에 대한 더 많은 정보는 documentation pages에서 찾을 수 있습니다.

source: More interestingly, patterns can involve nested constructors, as in the following examples.
ko: 더 흥미롭게도 패턴은 다음 예제에 있는 중첩된 생성자에도 관여할 수 있습니다.

source: More on Implicit Arguments
ko: 암시적인 인수에 대해 더 알아보기

source: More on Namespaces
ko: 이름공간에 대해 더 알아보기

source: More on Sections
ko: 섹션에 대해 더 알아보기

source: More on the Proof Language
ko: 증명 언어에 대한 자세한 내용

source: More precisely, Lean's parser follows a local longest parse rule in the presence of ambiguous grammars: when parsing the right-hand side of a ~ in a ~ b ~ c, it will continue parsing as long as possible (as the current precedence allows), not stopping after b but parsing ~ c as well.
ko: 더 정확히는 린의 구문분석기는 모호한 문법의 존재에 대해 지역의 가장 긴 구문분석 규칙을 따릅니다. a ~ b ~ c에서 a ~의 우변을 분석할 때 구문분석기는 (현재 우선순위가 허용하는 만큼) 가능한 최대한 분석을 지속할 것입니다. b 뒤에서 멈추지 않고 ~ c에서도 분석을 멈추지 않습니다.

source: More specifically, Lean is based on a version of a system known as the Calculus of Constructions with inductive types.
ko: 더 구체적으로 Lean은 귀납형(inductive types)의 직관주의적 계산법(calculus of Construction)으로 알려진 시스템에 기반한 버전입니다.

source: More to the point, it can be viewed as a system for writing programs with a precise semantics, as well as reasoning about the functions that the programs compute.
ko: 더욱이 이것은 정밀한 의미를 갖는 편집프로그램이나 프로그램이 계산하는 함수에 대한 추론 프로그램으로도 볼 수 있습니다.

source: Moreover, a+b, a*b, a-b, a/b, and a%b are notations for the heterogeneous versions.
ko: 게다가 a+b, a*b, a-b, a/b과 a%b은 이형 버전에 대한 표기입니다.

source: Moreover, Type u is also just syntactic sugar for Sort (u+1).
ko: 게다가 Type u도 Sort (u+1)에 대한 문법적 설탕입니다.

source: Moreover, Lean flags an error if the selected goal is not fully solved at the end of the case block.
ko: 게다가 린은 선택된 목표가 case 블록의 끝에서 완전히 풀리지 않았다면 오류를 표시합니다.

source: Moreover, Lean provides convenient notation for defining instances of a given structure.
ko: 게다가 린은 주어진 구조체의 개체를 정의하는데 편리한 기호를 제공합니다.

source: Moreover, decidability is preserved under propositional connectives:
ko: 게다가 결정 가능성은 명제 연결사 하에 보존됩니다.

source: Moreover, if instances are declared in other modules, the order in which they are tried depends on the order in which namespaces are opened.
ko: 또한 개체가 다른 모듈에서 선언된 경우 시도되는 순서는 이름공간이 열린 순서에 의존합니다.

source: Moreover, once we make this identification, the rules for implication show that we can pass back and forth between Implies p q and p → q.
ko: 게다가 한번 우리가 이런 식별을 하면 함의 규칙은 Implies p q과 p → q의 앞뒤를 오갈 수 있다는 것을 보여줍니다.

source: Moreover, tactics offer a gateway to using Lean's automation, since automated procedures are themselves tactics.
ko: 게다가 자동화된 절차 자체가 전략이기 때문에 전략은 Lean의 자동화를 사용하기 위한 관문을 제공합니다.

source: Moreover, the constructors and the recursors provide the only means of defining functions on these types.
ko: 게다가 생성자와 재귀자는 이 유형에 대한 함수 정의의 유일한 수단을 제공합니다.

source: Moreover, the output indicates that the first argument is implicit.
ko: 게다가 출력은 첫 번째 인수가 암시적임을 가리킵니다.

source: Moreover, the zero = n + 1 case is unreachable, and the canonical way to discard such a case is to use noConfusion.
ko: 게다가 zero = n + 1 경우는 도달할 수 없고 정식 방법으로 이 경우를 버리려면 noConfusion을 사용합니다.

source: Moreover, you can use a "wildcard" asterisk to simplify all the hypotheses and the goal:
ko: 게다가 여러분은 "와일드카드" *로 모든 가정과 목표를 간단히 하는데 사용할 수 있습니다.

source: Most of these commands have global effects, which is to say, that they remain in effect not only in the current file, but also in any file that imports it.
ko: 대개 이런 명령들은 전역 효과를 갖습니다. 그 말은 즉, 그들이 현재 파일 뿐 아니라 그것을 불러오는 모든 파일에 대해 영향이 남는다는 것입니다.

source: Most parts are optional.
ko: 대부분은 선택적입니다.

source: Moving a hypothesis into the goal yields an implication:
ko: 가정을 목표 속으로 옮김으로써 함의를 얻습니다.

source: Much of the background information you will need in order to do this is not specific to Lean at all.
ko: 이를 배우기 위해 필요한 대부분의 배경지식은 Lean으로만 국한되어 있지 않습니다.

source: Multiple rewrites can be combined using the notation rw [t_1, ..., t_n], which is just shorthand for rw t_1; ...; rw t_n.
ko: 다수의 다시쓰기는 rw [t_1, ..., t_n] 표기을 사용해 결합될 수 있습니다. 이것은 rw t_1; ...; rw t_n의 축약된 겁니다.

source: Multiple tactic applications can be written in a single line by concatenating with a semicolon.
ko: 복수의 전략들은 세미콜론으로 연결한 한 줄에 작성될 수 있습니다.

source: Mutual Recursion
ko: 상호적인 재귀

source: Mutual and Nested Inductive Types
ko: 상호적으로 중첩된 귀납형

source: Mutual recursive definitions also provide natural ways of working with mutual and nested inductive types, as described in :numref:mutual_and_nested_inductive_types.
ko: 상호적으로 재귀적인 정의도 :numref:상호적이고 중첩된 재귀형에서 설명한 것처럼 상호적이고 중첩된 귀납형을 다루는 자연스러운 방식을 제공합니다.

source: Named Arguments
ko: 이름 인자

source: Named arguments also improve the readability of your code by identifying what each argument represents.
ko: 이름 지어진 인자들은 각 인자가 나타내는 것을 명시함으로써 여러분의 코드의 가독성을 개선합니다.

source: Named arguments enable you to specify an argument for a parameter by matching the argument with its name rather than with its position in the parameter list.
ko: 이름 인자는 여러분이 매개변수 리스트에 대한 그것의 위치보다는 그것의 이름으로 매개변수에 대한 인자를 명시하게 해줍니다.

source: Names like Prod.rec are protected, which means that one has to use the full name even when the Prod namespace is open.
ko: Prod.rec같은 이름은 protected입니다. 그말은 누군가가 Prod 이름공간을 개방했더라도 완전한 이름을 사용해야만 함을 의미합니다.

source: Namespaces
ko: 이름공간(Namespaces)

source: Namespaces and sections serve different purposes: namespaces organize data and sections declare variables for insertion in definitions.
ko: 이름공간과 섹션은 다른 목적을 갖고 일합니다. 이름공간은 데이터를 정리하고 섹션은 정의의 삽입에 대해 변수를 선언합니다.

source: Namespaces that have been closed can later be reopened, even in another file:
ko: 닫힌 이름공간은 심지어 다른 파일일지라도 나중에 다시 열릴 수 있습니다.

source: Navigation using the above commands can be tedious.
ko: 위 명령을 사용한 탐색은 지루할 수 있습니다.

source: Negation and Falsity
ko: 부정과 거짓

source: Negation, ¬p, is actually defined to be p → False, so we obtain ¬p by deriving a contradiction from p.
ko: 부정 ¬p은 실제로 p → False로 정의되어 있습니다. 그래서 우리는 p로부터 모순을 유도함으로써 ¬p를 얻습니다.

source: Nonetheless, it makes sense to describe the declarations here, because they are straightforward variations on ordinary inductive definitions.
ko: 그래도 여전히 여기에 선언을 설명하는 것이 이치에 맞는 것 같습니다.왜냐하면 그들은 평범한 재귀적 정의에 직관적인 변형이기 때문입니다.

source: Nor do you have to name a section, which is to say, you can use an anonymous section / end pair.
ko: 섹션에 이름을 줄 필요도 없습니다. 그말은 즉슨, 여러분은 익명의 section / end 쌍을 사용할 수 있다는 것입니다.

source: Not
ko: 부정

source: Not all of the information found here will be useful to you right away.
ko: 여기서 찾은 모든 정보가 여러분에게 바로 유용하지 않을 수 있습니다.

source: Notably, however, there is only one constructor, refl, which is an element of Eq a a, and the curly braces after the constructor tell Lean to make the argument to refl explicit.
ko: 하지만 주목할 점은 오직 Eq a a의 원소인 한 생성자 refl있습니다. 그리고 생성자 뒤의 중괄호는 린에게 refl을 명시적인 인수로 만들게 합니다.

source: Notation
ko: 기호

source: Notationally, this hides the specification of the type, making it look as though ident simply takes an argument of any type.
ko: 표기상으로 ident가 단순히 임의의 유형의 인수를 받을 수 있는 것처럼 만들어 유형의 명세를 감춥니다.

source: Notations and Precedence
ko: 기호와 결합순서

source: Note that × is a Unicode symbol.
ko: ×은 유니코드 기호임을 보세요.

source: Note Inhabited.default doesn't have any explicit argument.
ko: Inhabited.default가 어떤 명시적인 인수도 갖지 않음을 주목하세요.

source: Note that if we used notation directly to introduce an infix notation like
ko: 만약 우리가 이처럼 notation를 전위 표기를 바로 도입하도록 사용한다면

source: Note that Eq a a is the only inhabited type in the family of types Eq a x.
ko: Eq a a는 Eq a x형의 군에서 유일한 내장 유형임을 주목하세요.

source: Note that Exists.intro has implicit arguments: Lean has to infer the predicate p : α → Prop in the conclusion ∃ x, p x.
ko: Exists.intro은 암시적인자를 가지고 있음을 유의하세요. 린은 결론 ∃ x, p x에서 술어 p : α → Prop를 추론해야만 합니다.

source: Note that Nat.mul_add and Nat.add_mul are alternative names for Nat.left_distrib and Nat.right_distrib, respectively.
ko: Nat.mul_add과 Nat.add_mul은 각각 Nat.left_distrib과 Nat.right_distrib에 대한 별명임을 유의하세요.

source: Note that WellFounded.fix works equally well as an induction principle.
ko: WellFounded.fix는 귀납 원리와 같이 동등하게 동작함을 주목하세요.

source: Note that x + y is notation for Add.add x y in Lean.
ko: x + y는 린에서 Add.add x y에 대한 기호임을 주의하세요.

source: Note that Lean hides the other goals inside the case block.
ko: 린은 case블록 안에 다른 목표를 숨긴 것을 주목하세요.

source: Note that Lean inferred a more general type using Sort instead of Type.
ko: 린은 Type대신 Sort를 사용하여 더 일반적인 유형을 추론함을 보세요.

source: Note that double does not have y as argument.
ko: double은 y를 인수로서 갖지 않음을 주목하세요.

source: Note that it is often useful to use numeric unicode subscripts, entered as \0, \1, \2, ..., for hypotheses, as we did in this example.
ko: 수치 유니코드 밑첨자를 사용하는 것은 종종 유용합니다. 이 예제에서 그런 것처럼 가정에 대해 \0, \1, \2, ..., 으로 쳐서 쓸 수 있습니다.

source: Note that names automatically generated by Lean are inaccessible by default.
ko: 린에 의해 자동으로 생성된 이름들은 기본적으로 접근할 수 없습니다.

source: Note that the match expression is compiled using the recursor Weekday.rec generated when you declare the inductive type.
ko: match 표현식은 여러분이 귀납형을 선언할 때 생성한 recursor Weekday.rec을 사용하여 컴파일 됩니다.

source: Note that the theorem command is really a version of the def command: under the propositions and types correspondence, proving the theorem p → q → p is really the same as defining an element of the associated type.
ko: theorem 명령은 def 명령의 한 버전이라는 것을 주목하세요. 명제와 유형 대응 하에서 정리 p → q → p의 증명하는 것은 연관된 유형의 원소를 증명하는 것과 정말 같습니다.

source: Note that the anonymous constructor notation ⟨w, hw.right, hw.left⟩ abbreviates a nested constructor application; we could equally well have written ⟨w, ⟨hw.right, hw.left⟩⟩.
ko: 익명 생성자 기호 ⟨w, hw.right, hw.left⟩가 중첩된 생성자 활용을 간략히 한다는 것을 주목하세요. 우리는 이를 ⟨w, ⟨hw.right, hw.left⟩⟩로 동등한 의미를 갖게 쓸 수 있습니다.

source: Note that the patterns are separated by commas.
ko: 패턴이 콤마로 나뉜 것에 주목하세요.

source: Note that the syntax is similar to the one used in match expressions.
ko: 문법이 match 표현식에서의 것과 비슷함에 주목하세요.

source: Note that the universe polymorphic compose is even more verbose than the one previously defined.
ko: 심지어 세계 다형적 compose는 이전에 정의한 것보다 더 장황합니다.

source: Note that the various simp options we have discussed --- giving an explicit list of rules, and using at to specify the location --- can be combined, but the order they are listed is rigid.
ko: 논의한 다양한 simp 옵션은 규칙의 명시적인 리스트를 주고 at을 사용해 위치를 나타내는 것으로 결합될 수 있다. 그러나 나열된 순서는 변하지 않는다.

source: Note that this example is somewhat artificial, one could also do:
ko: 이 예제는 다소 인위적이며 누군가는 다음과 같이 할 수 있음을 보세요.

source: Note that up to the names we have chosen for the variables, the definitions are identical to the proofs of the analogous propositions for conjunction and disjunction.
ko: 우리가 변수에 대한 이름을 선택하는 한 정의들은 결합자와 분리자에 대한 유사한 명제의 증명과 동일할 것임을 주목하세요.

source: Note that we can omit recursive equations for "unreachable" cases such as head nil.
ko: 우리는 재귀 방정식을 head nil 같이 "도달할 수 없는" 경우에 대해 생략할 수 있음을 주목하세요.

source: Note that you can define a binary operation like and using match:
ko: 여러분이 and같은 이항 연산을 match를 사용해 정의할 수 있다는 것을 보세요.

source: Note that you can double a natural number n by double { add := Nat.add } n.
ko: 여러분은 자연수 n을 double { add := Nat.add } n으로 두 배로 할 수 있습니다.

source: Note that you chain instances and generalize the second instance.
ko: 여러분은 개체를 연결하고 두 번째 개체를 일반화함을 주목하세요.

source: Note that, Lean "closes" the declaration by adding any local variable occurring in the let rec declaration as additional parameters.
ko: 린이 추가적인 매개변수로 let rec 선언에서 생긴 임의의 지역변수를 추가함으로써 선언이 닫힌다는 점을 주목하세요.

source: Notice also that, when the value of an argument is not needed in the definition, you can use an underscore instead.
ko: 인수의 값은 정의에서 필요하지 않음도 주목하세요. 여러분은 대신 밑줄 문자를 쓸 수 있습니다.
